CommonSecurityLog
| where DeviceVendor == "pfSense" or SourceSystem == "SecurityEvents"
| where Message has "block" and SourceIP startswith "10.20."
| summarize count() by SourceIP, DestinationIP, DestinationPort, bin(TimeGenerated, 15m)
| order by TimeGenerated desc

